// Гарант+ Килипенко 24.04.2025 [F00227785] Обмен Университет-БГУ ++ {
#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение:
//  - Булево
Функция ЭтоБазаБГУ() Экспорт
    ИмяИнформационнойБазы = Метаданные.Имя;
    Возврат (СтрНайти(ИмяИнформационнойБазы, "Бухгалтерия") > 0);
КонецФункции

// Возвращаемое значение:
//  - Булево
Функция ЭтоБазаУниверситет() Экспорт
    ИмяИнформационнойБазы = Метаданные.Имя;
    Возврат (СтрНайти(ИмяИнформационнойБазы, "Университет") > 0);
КонецФункции

// Возвращаемое значение:
//  - ТаблицаЗначений
//      * НаименованиеУниверситет - Строка
//      * НаименованиеБГУ - Строка
Функция ПолучитьТаблицуСоответствийНаименованийФакультетовПоУмолчанию() Экспорт
    РезультатФункции = Новый ТаблицаЗначений();
    РезультатФункции.Колонки.Добавить("НаименованиеУниверситет", ОбщегоНазначения.ОписаниеТипаСтрока(500));
    РезультатФункции.Колонки.Добавить("НаименованиеБГУ", ОбщегоНазначения.ОписаниеТипаСтрока(500));

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Институт непрерывного образования";
    НоваяСтрока.НаименованиеБГУ = "Аспиранты";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Дефектологический факультет";
    НоваяСтрока.НаименованиеБГУ = "Дефектологический";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Естественно-географический факультет";
    НоваяСтрока.НаименованиеБГУ = "Естественно-географический";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Индустриально-педагогический факультет";
    НоваяСтрока.НаименованиеБГУ = "Индустриально-педагогический";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Факультет иностранных языков";
    НоваяСтрока.НаименованиеБГУ = "Иностранных языков (англ.,нем.,франц.,)";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Институт экономики и управления";
    НоваяСтрока.НаименованиеБГУ = "Институт экономики и управления";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Факультет искусств и арт-педагогики";
    НоваяСтрока.НаименованиеБГУ = "Искусств и артпедагогики";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Исторический факультет";
    НоваяСтрока.НаименованиеБГУ = "Исторический";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Кафедра иностранных языков и профессиональной коммуникации";
    НоваяСтрока.НаименованиеБГУ = "Кафедра иностранных языков и профессиональной коммуникации";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Институт социальных инноваций и технологий";
    НоваяСтрока.НаименованиеБГУ = "Кафедра социальной работы";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Факультет педагогики и психологии";
    НоваяСтрока.НаименованиеБГУ = "Педагогики и психологии";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Факультет теологии и религиоведения";
    НоваяСтрока.НаименованиеБГУ = "Теологии и Религиоведения";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Факультет физики, математики, информатики";
    НоваяСтрока.НаименованиеБГУ = "Факультет физики,математики и информатики";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Факультет физической культуры и спорта";
    НоваяСтрока.НаименованиеБГУ = "Физической  культуры и спорта";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Филологический факультет";
    НоваяСтрока.НаименованиеБГУ = "Филологический";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Факультет философии и социологии";
    НоваяСтрока.НаименованиеБГУ = "Философия, социология и культурология";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Художественно-графический факультет";
    НоваяСтрока.НаименованиеБГУ = "Художественно-графический";

    НоваяСтрока = РезультатФункции.Добавить();
    НоваяСтрока.НаименованиеУниверситет = "Юридический факультет";
    НоваяСтрока.НаименованиеБГУ = "Юридический";

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  НаименованиеУниверситет - Строка
// Возвращаемое значение:
//  - Строка, Неопределено
Функция ПолучитьСоответствиеНаименованиеФакультетаБГУ(Знач НаименованиеУниверситет) Экспорт
    ТаблицаСоответствий = ПолучитьТаблицуСоответствийНаименованийФакультетовПоУмолчанию();
    НайденныеСтроки = ТаблицаСоответствий.НайтиСтроки(Новый Структура("НаименованиеУниверситет", НаименованиеУниверситет));
    Если НайденныеСтроки.Количество() > 0 Тогда
        Возврат НайденныеСтроки[0].НаименованиеБГУ;
    Иначе
        Возврат Неопределено;
    КонецЕсли;
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
// Гарант+ Килипенко 24.04.2025 [F00227785] Обмен Университет-БГУ -- }
