// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ ++ {
#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоБазаБГУ() Экспорт
    ИмяИнформационнойБазы = Метаданные.Имя;
    Возврат (СтрНайти(ИмяИнформационнойБазы, "Бухгалтерия") > 0);
КонецФункции

Функция ЭтоБазаУниверситет() Экспорт
    ИмяИнформационнойБазы = Метаданные.Имя;
    Возврат (СтрНайти(ИмяИнформационнойБазы, "Университет") > 0);
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ -- }
