// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ ++ {
#Область ПрограммныйИнтерфейс

Функция ЭтоБазаБГУ() Экспорт
    ИмяИнформационнойБазы = ОбменДаннымиПовтИсп.ИмяЭтойИнформационнойБазы();
    Возврат (СтрНайти(ИмяИнформационнойБазы, "Бухгалтерия") > 0);
КонецФункции

Функция ЭтоБазаУниверситет() Экспорт
    ИмяИнформационнойБазы = ОбменДаннымиПовтИсп.ИмяЭтойИнформационнойБазы();
    Возврат (СтрНайти(ИмяИнформационнойБазы, "Университет") > 0);
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ -- }
