// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ ++ {
#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//  - Строка
Функция ПолучитьКодБазыУниверситет() Экспорт
    КодБазы = "univer";
    Возврат КодБазы;
КонецФункции

// Возвращаемое значение:
//  - Строка
Функция ПолучитьКодБазыБГУ() Экспорт
    КодБазы = "bgu";
    Возврат КодБазы;
КонецФункции

// Параметры:
//  ДатаОтправки - Дата
// Возвращаемое значение:
//  - Дата
Функция РассчитатьДатуУстареванияСообщения(Знач ДатаОтправки) Экспорт
    Возврат ДатаОтправки + ПолучитьИнтервалУстареванияСообщения();
КонецФункции

// Возвращаемое значение:
//  - Число - Интервал в секундах
Функция ПолучитьИнтервалУстареванияСообщения() Экспорт
    Возврат (60 * 5); // 5 минут
КонецФункции

#Область БГУ

// Параметры:
//  ТестовыйРежим - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьИмяКаналаОбменаВУниверситет(Знач ТестовыйРежим) Экспорт
    РезультатФункции = "ОбменУниверситет_ИзБухгалтерии";
    Если ТестовыйРежим = Истина Тогда
        РезультатФункции = РезультатФункции + "Тест";
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  ТестовыйРежим - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьИмяКаналаОбменаИзУниверситета(Знач ТестовыйРежим) Экспорт
    РезультатФункции = "ОбменУниверситет_ВБухгалтерию";
    Если ТестовыйРежим = Истина Тогда
        РезультатФункции = РезультатФункции + "Тест";
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // БГУ

#Область Университет

// Параметры:
//  ТестовыйРежим - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьИмяКаналаОбменаВБухгалтерию(Знач ТестовыйРежим) Экспорт
    РезультатФункции = "ОбменБГУ_ИзУниверситет";
    Если ТестовыйРежим = Истина Тогда
        РезультатФункции = РезультатФункции + "Тест";
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  ТестовыйРежим - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьИмяКаналаОбменаИзБухгалтерии(Знач ТестовыйРежим) Экспорт
    РезультатФункции = "ОбменБГУ_ВУниверситет";
    Если ТестовыйРежим = Истина Тогда
        РезультатФункции = РезультатФункции + "Тест";
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // Университет

// Возвращаемое значение:
//  - Строка
Функция ПолучитьИмяСобытияДляЖурнала() Экспорт
    Возврат "Обмен Университет-БГУ";
КонецФункции

#Область РаботаJSON

// Параметры:
//  Дата - Дата
// Возвращаемое значение:
//  - Строка
Функция ПолучитьСтрокуДатыJSON(Знач Дата) Экспорт
    Если Дата = Неопределено ИЛИ ПустаяСтрока(Дата) Тогда
        Дата = Дата(1, 1, 1);
    КонецЕсли;

    Возврат ЗаписатьДатуJSON(Дата, ФорматДатыJSON.JavaScript, ВариантЗаписиДатыJSON.УниверсальнаяДата);
КонецФункции

// Параметры:
//  СтрокаДаты - Строка
// Возвращаемое значение:
//  - Дата
Функция ПолучитьДатуИзСтрокиJSON(Знач СтрокаДаты) Экспорт
    Если СтрокаДаты = Неопределено ИЛИ ПустаяСтрока(СтрокаДаты) Тогда
        Возврат Дата(1, 1, 1);
    КонецЕсли;

    Возврат ПрочитатьДатуJSON(СтрокаДаты, ФорматДатыJSON.JavaScript);
КонецФункции

// Параметры:
//  СтрокаЗначения - Строка
// Возвращаемое значение:
//  - Булево
Функция ПолучитьБулевоИзСтроки(Знач СтрокаЗначения) Экспорт
    СтрокаЗначения = СокрЛП(Строка(СтрокаЗначения));

    Если СтрокаЗначения = "1" Тогда
        Возврат Истина;
    ИначеЕсли СтрокаЗначения = "0" Тогда
        Возврат Ложь;
    КонецЕсли;

    ШаблонПоиска = "истина";
    Возврат НРег(СтрокаЗначения) = ШаблонПоиска;
КонецФункции

// Параметры:
//  Значение - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьСтрокуИзБулево(Знач Значение) Экспорт
    ЗначениеДляИстина = "1";
    ЗначениеДляЛожь = "0";

    Если Значение = Истина Тогда
        Возврат ЗначениеДляИстина;
    Иначе
        Возврат ЗначениеДляЛожь;
    КонецЕсли;
КонецФункции

#КонецОбласти // РаботаJSON

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ -- }
