// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ ++ {
#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//  - Строка
Функция ПолучитьКодБазыУниверситет(Знач Тестовый) Экспорт
    КодБазы = "univer";
    Возврат ?(Тестовый, КодБазы + "_dev", КодБазы);
КонецФункции

// Возвращаемое значение:
//  - Строка
Функция ПолучитьКодБазыБГУ(Знач Тестовый) Экспорт
    КодБазы = "bgu";
    Возврат ?(Тестовый, КодБазы + "_dev", КодБазы);
КонецФункции

Функция ПолучитВремяАктуальности(Знач ДатаТранзакции) Экспорт
    Возврат ДатаТранзакции + (60 * 60);
КонецФункции


#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ -- }