// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ ++ {
#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//  - Строка
Функция ПолучитьКодБазыУниверситет(Знач Тестовый) Экспорт
    КодБазы = "univer";
    Возврат ?(Тестовый, КодБазы + "_dev", КодБазы);
КонецФункции

// Возвращаемое значение:
//  - Строка
Функция ПолучитьКодБазыБГУ(Знач Тестовый) Экспорт
    КодБазы = "bgu";
    Возврат ?(Тестовый, КодБазы + "_dev", КодБазы);
КонецФункции

// Параметры:
//  ДатаОтправки - Дата
// Возвращаемое значение:
//  - Дата
Функция РассчитатьДатуУстареванияСообщения(Знач ДатаОтправки) Экспорт
    Возврат ДатаОтправки + ПолучитьИнтервалУстареванияСообщения();
КонецФункции

// Возвращаемое значение:
//  - Число - Интервал в секундах
Функция ПолучитьИнтервалУстареванияСообщения() Экспорт
    Возврат (60 * 5); // 5 минут
КонецФункции

// Параметры:
//  ТестовыйРежим - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьИмяКаналаОбменаВУниверситет(Знач ТестовыйРежим) Экспорт
    РезультатФункции = "ОбменУниверситет_ИзБухгалтерии";
    Если ТестовыйРежим = Истина Тогда
        РезультатФункции = РезультатФункции + "Тест";
    КонецЕсли;
    
    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  ТестовыйРежим - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьИмяКаналаОбменаИзУниверситета(Знач ТестовыйРежим) Экспорт
    РезультатФункции = "ОбменУниверситет_ВБухгалтерию";
    Если ТестовыйРежим = Истина Тогда
        РезультатФункции = РезультатФункции + "Тест";
    КонецЕсли;
    
    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ -- }