// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ ++ {
#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//  - Строка
Функция ПолучитьКодБазыУниверситет() Экспорт
    КодБазы = "univer";
    Возврат КодБазы;
КонецФункции

// Возвращаемое значение:
//  - Строка
Функция ПолучитьКодБазыБГУ() Экспорт
    КодБазы = "bgu";
    Возврат КодБазы;
КонецФункции

// Параметры:
//  ДатаОтправки - Дата
// Возвращаемое значение:
//  - Дата
Функция РассчитатьДатуУстареванияСообщения(Знач ДатаОтправки) Экспорт
    Возврат ДатаОтправки + ПолучитьИнтервалУстареванияСообщения();
КонецФункции

// Возвращаемое значение:
//  - Число - Интервал в секундах
Функция ПолучитьИнтервалУстареванияСообщения() Экспорт
    Возврат (60 * 5); // 5 минут
КонецФункции

#Область БГУ

// Параметры:
//  ТестовыйРежим - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьИмяКаналаОбменаВУниверситет(Знач ТестовыйРежим) Экспорт
    РезультатФункции = "ОбменУниверситет_ИзБухгалтерии";
    Если ТестовыйРежим = Истина Тогда
        РезультатФункции = РезультатФункции + "Тест";
    КонецЕсли;
    
    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  ТестовыйРежим - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьИмяКаналаОбменаИзУниверситета(Знач ТестовыйРежим) Экспорт
    РезультатФункции = "ОбменУниверситет_ВБухгалтерию";
    Если ТестовыйРежим = Истина Тогда
        РезультатФункции = РезультатФункции + "Тест";
    КонецЕсли;
    
    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // БГУ

#Область Университет

// Параметры:
//  ТестовыйРежим - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьИмяКаналаОбменаВБухгалтерию(Знач ТестовыйРежим) Экспорт
    РезультатФункции = "ОбменБГУ_ИзУниверситет";
    Если ТестовыйРежим = Истина Тогда
        РезультатФункции = РезультатФункции + "Тест";
    КонецЕсли;
    
    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  ТестовыйРежим - Булево
// Возвращаемое значение:
//  - Строка
Функция ПолучитьИмяКаналаОбменаИзБухгалтерии(Знач ТестовыйРежим) Экспорт
    РезультатФункции = "ОбменБГУ_ВУниверситет";
    Если ТестовыйРежим = Истина Тогда
        РезультатФункции = РезультатФункции + "Тест";
    КонецЕсли;
    
    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // Университет

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ -- }