// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ ++ {
#Область ПрограммныйИнтерфейс

Функция ПолучитьСервисОбмена() Экспорт
    Возврат СервисыИнтеграции.ГП_СервисИнтеграцииБГУУниверситет;
КонецФункции

Функция ПолучитьНаименованиеСервисаОбменаУниверситет() Экспорт
    Возврат СтандартныеПодсистемыВызовСервера.ИмяОбъектаМетаданных(ТипЗнч(ПолучитьСервисОбмена()));
КонецФункции

// Параметры:
//  ТестовыйРежим - Булево
Функция ПолучитьКаналОбменаВУниверситет(Знач ТестовыйРежим, Знач Сервис = Неопределено) Экспорт
    СервисИнтеграции = ?(Сервис = Неопределено, ПолучитьСервисОбмена(), Сервис);
    Возврат СервисИнтеграции[ГП_ОбменУниверситетБГУКлиентСервер.ПолучитьИмяКаналаОбменаВУниверситет(ТестовыйРежим)];
КонецФункции

// Параметры:
//  ТестовыйРежим - Булево
Функция ПолучитьКаналОбменаИзУниверситета(Знач ТестовыйРежим, Знач Сервис = Неопределено) Экспорт
    СервисИнтеграции = ?(Сервис = Неопределено, ПолучитьСервисОбмена(), Сервис);
    Возврат СервисИнтеграции[ГП_ОбменУниверситетБГУКлиентСервер.ПолучитьИмяКаналаОбменаИзУниверситета(ТестовыйРежим)];
КонецФункции

// Параметры:
//  КаналОбмена
//  ПараметрыОтбора - Структура
//      * КодПолучателя - Строка
//      * КодОтправителя - Строка
//      * ИдентификаторСообщенияЗапроса - УникальныйИдентификатор
//      * ДатаОтправкиЗапроса - Дата
//  ЗадержкаМсек - Число, Неопределено - По умолчанию 1000 мс
// Возвращаемое значение:
//  - Массив из Структура
//      * ДатаОтправки - Дата
//      * ДатаУстаревания - Дата
//      * Идентификатор - УникальныйИдентификатор
//      * ИдентификаторСообщенияЗапроса - УникальныйИдентификатор
//      * КодОтправителя - Строка
//      * КодПолучателя - Строка
//      * Параметры - Соответствие
//      * ПредставлениеТелаСообщения - Строка
Функция ПолучитьСообщенияСервиса(КаналОбмена, Знач ПараметрыОтбора, Знач ЗадержкаМсек = Неопределено) Экспорт
    Возврат ГП_СервисыИнтеграции.ПолучитьСообщенияСервиса(КаналОбмена, ПараметрыОтбора, ЗадержкаМсек);
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ -- }
