// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ ++ {
#Область ПрограммныйИнтерфейс

Функция ПолучитьСервисОбмена() Экспорт
    ЭтоБазаБГУ = ЭтоБазаБГУ();
    ЭтоБазаУниверситет = (НЕ ЭтоБазаБГУ) И ЭтоБазаУниверситет();

    Если ЭтоБазаБГУ Тогда
        Возврат СервисыИнтеграции.ГП_СервисИнтеграцииБГУУниверситет;
    ИначеЕсли ЭтоБазаУниверситет Тогда
        Возврат СервисыИнтеграции.ГП_СервисИнтеграцииУниверситетБГУ;
    Иначе
        ВызватьИсключение(СтрШаблон("База << %1 >> не поддерживается сервисом обмена << (Гарант+) Университет-БГУ >>",
                ОбменДаннымиПовтИсп.ИмяЭтойИнформационнойБазы()));
    КонецЕсли;
КонецФункции

// Возвращаемое значение:
//  - Булево
Функция ЭтоБазаБГУ() Экспорт
    Возврат ГП_ОбменУниверситетБГУПовтИсп.ЭтоБазаБГУ();
КонецФункции

// Возвращаемое значение:
//  - Булево
Функция ЭтоБазаУниверситет() Экспорт
    Возврат ГП_ОбменУниверситетБГУПовтИсп.ЭтоБазаУниверситет();
КонецФункции

// Возвращаемое значение:
//  - Строка
Функция ПолучитьНаименованиеСервисаОбменаУниверситет() Экспорт
    Возврат СтандартныеПодсистемыВызовСервера.ИмяОбъектаМетаданных(ТипЗнч(ПолучитьСервисОбмена()));
КонецФункции

#Область БГУ

// Параметры:
//  ТестовыйРежим - Булево
//  Сервис - СервисИнтеграции
Функция ПолучитьКаналОбменаВУниверситет(Знач ТестовыйРежим, Знач Сервис = Неопределено) Экспорт
    Если ЭтоБазаБГУ() = Ложь Тогда
        ВызватьИсключение("Канал ""ВУниверситет"" поддерживается только базой БГУ");
    КонецЕсли;

    СервисИнтеграции = ?(Сервис = Неопределено, ПолучитьСервисОбмена(), Сервис);
    Возврат СервисИнтеграции[ГП_ОбменУниверситетБГУКлиентСервер.ПолучитьИмяКаналаОбменаВУниверситет(ТестовыйРежим)];
КонецФункции

// Параметры:
//  ТестовыйРежим - Булево
//  Сервис - СервисИнтеграции
Функция ПолучитьКаналОбменаИзУниверситета(Знач ТестовыйРежим, Знач Сервис = Неопределено) Экспорт
    Если ЭтоБазаБГУ() = Ложь Тогда
        ВызватьИсключение("Канал ""ИзУниверситета"" поддерживается только базой БГУ");
    КонецЕсли;

    СервисИнтеграции = ?(Сервис = Неопределено, ПолучитьСервисОбмена(), Сервис);
    Возврат СервисИнтеграции[ГП_ОбменУниверситетБГУКлиентСервер.ПолучитьИмяКаналаОбменаИзУниверситета(ТестовыйРежим)];
КонецФункции

#КонецОбласти // БГУ

#Область Университет

// Параметры:
//  ТестовыйРежим - Булево
//  Сервис - СервисИнтеграции
Функция ПолучитьКаналОбменаВБухгалтерию(Знач ТестовыйРежим, Знач Сервис = Неопределено) Экспорт
    Если ЭтоБазаУниверситет() = Ложь Тогда
        ВызватьИсключение("Канал ""ВБухгалтерию"" поддерживается только базой БГУ");
    КонецЕсли;

    СервисИнтеграции = ?(Сервис = Неопределено, ПолучитьСервисОбмена(), Сервис);
    Возврат СервисИнтеграции[ГП_ОбменУниверситетБГУКлиентСервер.ПолучитьИмяКаналаОбменаВБухгалтерию(ТестовыйРежим)];
КонецФункции

// Параметры:
//  ТестовыйРежим - Булево
//  Сервис - СервисИнтеграции
Функция ПолучитьКаналОбменаИзБухгалтерии(Знач ТестовыйРежим, Знач Сервис = Неопределено) Экспорт
    Если ЭтоБазаУниверситет() = Ложь Тогда
        ВызватьИсключение("Канал ""ИзБухгалтерии"" поддерживается только базой БГУ");
    КонецЕсли;

    СервисИнтеграции = ?(Сервис = Неопределено, ПолучитьСервисОбмена(), Сервис);
    Возврат СервисИнтеграции[ГП_ОбменУниверситетБГУКлиентСервер.ПолучитьИмяКаналаОбменаИзБухгалтерии(ТестовыйРежим)];
КонецФункции

#КонецОбласти // Университет

// Параметры:
//  КаналОбмена
//  ПараметрыОтбора - Структура
//      * КодПолучателя - Строка
//      * КодОтправителя - Строка
//      * ИдентификаторСообщенияЗапроса - УникальныйИдентификатор
//      * ДатаОтправкиЗапроса - Дата
//  ЗадержкаМсек - Число, Неопределено - По умолчанию 1000 мс
// Возвращаемое значение:
//  - Массив из Структура
//      * ДатаОтправки - Дата
//      * ДатаУстаревания - Дата
//      * Идентификатор - УникальныйИдентификатор
//      * ИдентификаторСообщенияЗапроса - УникальныйИдентификатор
//      * КодОтправителя - Строка
//      * КодПолучателя - Строка
//      * Параметры - Соответствие
//      * ПредставлениеТелаСообщения - Строка
Функция ПолучитьСообщенияСервиса(КаналОбмена, Знач ПараметрыОтбора, Знач ЗадержкаМсек = Неопределено) Экспорт
    Возврат ГП_СервисыИнтеграции.ПолучитьСообщенияСервиса(КаналОбмена, ПараметрыОтбора, ЗадержкаМсек);
КонецФункции

// Параметры:
//  ТелоСообщенияJSON - Строка
// Возвращаемое значение:
//  - Произвольный
Функция ПолучитьЗначениеТелаСообщенияУниверситетНаСервере(Знач ТелоСообщенияJSON) Экспорт
    РезультатФункции = ПрочитатьЗначениеJSON(ТелоСообщенияJSON);

    Если ТипЗнч(РезультатФункции) = Тип("Структура") ИЛИ ТипЗнч(РезультатФункции) = Тип("Соответствие") Тогда
        Для Каждого ЭлементКЗ Из РезультатФункции Цикл
            РезультатФункции[ЭлементКЗ.Ключ] = ПреобразоватьЗначениеПрочитанноеИзJSON(ЭлементКЗ.Значение);
        КонецЦикла;
    ИначеЕсли ТипЗнч(РезультатФункции) = Тип("Массив") Тогда
        Для ИндексЭлемента = 0 По РезультатФункции.Количество() - 1 Цикл
            РезультатФункции[ИндексЭлемента] = ПреобразоватьЗначениеПрочитанноеИзJSON(РезультатФункции[ИндексЭлемента]);
        КонецЦикла;
    Иначе
        РезультатФункции = ПреобразоватьЗначениеПрочитанноеИзJSON(РезультатФункции);
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ -- }

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Значение - Произвольный
//  ПараметрыПреобразования - Структура, Неопределено
// Возвращаемое значение:
//  - Произвольный
Функция ПреобразоватьЗначениеПрочитанноеИзJSON(Знач Значение, Знач ПараметрыПреобразования = Неопределено)
    РезультатФункции = Значение;

    ПараметрыПреобразования = ?(ПараметрыПреобразования = Неопределено, Новый Структура, ПараметрыПреобразования);

    ПреобразоватьДатуВМестную = ?(ПараметрыПреобразования.Свойство("ПреобразоватьДатуВМестную"),
            ПараметрыПреобразования.ПреобразоватьДатуВМестную, Ложь);
    ЭтоДата = Ложь;

    Если ТипЗнч(Значение) = Тип("Строка") Тогда
        ЭтоДата = Истина;
        Если СтрНачинаетсяС(Значение, "new Date(") И СтрЗаканчиваетсяНа(Значение, ")") Тогда // Это дата в формате JS
            РезультатФункции = ПрочитатьДатуJSON(Значение, ФорматДатыJSON.JavaScript);
        ИначеЕсли СтрНачинаетсяС(Значение, "/Date(") И СтрЗаканчиваетсяНа(Значение, ")") Тогда
            РезультатФункции = ПрочитатьДатуJSON(Значение, ФорматДатыJSON.Microsoft);
        Иначе
            ЭтоДата = Ложь;
        КонецЕсли;
    КонецЕсли;

    // Преобразование даты
    Если ЭтоДата = Истина И ПреобразоватьДатуВМестную = Истина Тогда
        РезультатФункции = ГП_СервисыИнтеграции.ПреобразоватьВМестнуюДатуСеанса(РезультатФункции);
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
