// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ ++ {
#Область ПрограммныйИнтерфейс

Функция ПолучитьСервисОбмена() Экспорт
    ЭтоБазаБГУ = ЭтоБазаБГУ();
    ЭтоБазаУниверситет = (НЕ ЭтоБазаБГУ) И ЭтоБазаУниверситет();

    Если ЭтоБазаБГУ Тогда
        Возврат СервисыИнтеграции.ГП_СервисИнтеграцииБГУУниверситет;
    ИначеЕсли ЭтоБазаУниверситет Тогда
        Возврат СервисыИнтеграции.ГП_СервисИнтеграцииУниверситетБГУ;
    Иначе
        ВызватьИсключение(СтрШаблон("База << %1 >> не поддерживается сервисом обмена << (Гарант+) Университет-БГУ >>",
                ОбменДаннымиПовтИсп.ИмяЭтойИнформационнойБазы()));
    КонецЕсли;
КонецФункции

Функция ЭтоБазаБГУ() Экспорт
    Возврат ГП_ОбменУниверситетБГУПовтИсп.ЭтоБазаБГУ();
КонецФункции

Функция ЭтоБазаУниверситет() Экспорт
    Возврат ГП_ОбменУниверситетБГУПовтИсп.ЭтоБазаУниверситет();
КонецФункции

Функция ПолучитьНаименованиеСервисаОбменаУниверситет() Экспорт
    Возврат СтандартныеПодсистемыВызовСервера.ИмяОбъектаМетаданных(ТипЗнч(ПолучитьСервисОбмена()));
КонецФункции

#Область БГУ

// Параметры:
//  ТестовыйРежим - Булево
//  Сервис - СервисИнтеграции
Функция ПолучитьКаналОбменаВУниверситет(Знач ТестовыйРежим, Знач Сервис = Неопределено) Экспорт
    Если ЭтоБазаБГУ() = Ложь Тогда
        ВызватьИсключение("Канал ""ВУниверситет"" поддерживается только базой БГУ");
    КонецЕсли;

    СервисИнтеграции = ?(Сервис = Неопределено, ПолучитьСервисОбмена(), Сервис);
    Возврат СервисИнтеграции[ГП_ОбменУниверситетБГУКлиентСервер.ПолучитьИмяКаналаОбменаВУниверситет(ТестовыйРежим)];
КонецФункции

// Параметры:
//  ТестовыйРежим - Булево
//  Сервис - СервисИнтеграции
Функция ПолучитьКаналОбменаИзУниверситета(Знач ТестовыйРежим, Знач Сервис = Неопределено) Экспорт
    Если ЭтоБазаБГУ() = Ложь Тогда
        ВызватьИсключение("Канал ""ИзУниверситета"" поддерживается только базой БГУ");
    КонецЕсли;

    СервисИнтеграции = ?(Сервис = Неопределено, ПолучитьСервисОбмена(), Сервис);
    Возврат СервисИнтеграции[ГП_ОбменУниверситетБГУКлиентСервер.ПолучитьИмяКаналаОбменаИзУниверситета(ТестовыйРежим)];
КонецФункции

#КонецОбласти // БГУ

#Область Университет

// Параметры:
//  ТестовыйРежим - Булево
//  Сервис - СервисИнтеграции
Функция ПолучитьКаналОбменаВБухгалтерию(Знач ТестовыйРежим, Знач Сервис = Неопределено) Экспорт
    Если ЭтоБазаУниверситет() = Ложь Тогда
        ВызватьИсключение("Канал ""ВБухгалтерию"" поддерживается только базой БГУ");
    КонецЕсли;

    СервисИнтеграции = ?(Сервис = Неопределено, ПолучитьСервисОбмена(), Сервис);
    Возврат СервисИнтеграции[ГП_ОбменУниверситетБГУКлиентСервер.ПолучитьИмяКаналаОбменаВБухгалтерию(ТестовыйРежим)];
КонецФункции

// Параметры:
//  ТестовыйРежим - Булево
//  Сервис - СервисИнтеграции
Функция ПолучитьКаналОбменаИзБухгалтерии(Знач ТестовыйРежим, Знач Сервис = Неопределено) Экспорт
    Если ЭтоБазаУниверситет() = Ложь Тогда
        ВызватьИсключение("Канал ""ИзБухгалтерии"" поддерживается только базой БГУ");
    КонецЕсли;

    СервисИнтеграции = ?(Сервис = Неопределено, ПолучитьСервисОбмена(), Сервис);
    Возврат СервисИнтеграции[ГП_ОбменУниверситетБГУКлиентСервер.ПолучитьИмяКаналаОбменаИзБухгалтерии(ТестовыйРежим)];
КонецФункции

#КонецОбласти // Университет

// Параметры:
//  КаналОбмена
//  ПараметрыОтбора - Структура
//      * КодПолучателя - Строка
//      * КодОтправителя - Строка
//      * ИдентификаторСообщенияЗапроса - УникальныйИдентификатор
//      * ДатаОтправкиЗапроса - Дата
//  ЗадержкаМсек - Число, Неопределено - По умолчанию 1000 мс
// Возвращаемое значение:
//  - Массив из Структура
//      * ДатаОтправки - Дата
//      * ДатаУстаревания - Дата
//      * Идентификатор - УникальныйИдентификатор
//      * ИдентификаторСообщенияЗапроса - УникальныйИдентификатор
//      * КодОтправителя - Строка
//      * КодПолучателя - Строка
//      * Параметры - Соответствие
//      * ПредставлениеТелаСообщения - Строка
Функция ПолучитьСообщенияСервиса(КаналОбмена, Знач ПараметрыОтбора, Знач ЗадержкаМсек = Неопределено) Экспорт
    Возврат ГП_СервисыИнтеграции.ПолучитьСообщенияСервиса(КаналОбмена, ПараметрыОтбора, ЗадержкаМсек);
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 24.04.2025 [] Обмен Университет-БГУ -- }
