
Процедура ОбменУниверситет_ВБухгалтериюОбработкаПолученияСообщения(Сообщение, Отказ)
    РазмерСообщения = Сообщение.Параметры.Получить("РазмерСообщения");
    Если РазмерСообщения <> Неопределено Тогда
        РазмерБуфера = Число(РазмерСообщения); 

    Иначе
        РазмерБуфера = 1024;

    КонецЕсли;

    Тело = Новый БуферДвоичныхДанных(0);
    Буфер = Новый БуферДвоичныхДанных(РазмерБуфера);

    Поток = Сообщение.ПолучитьТелоКакПоток();

    Пока Истина Цикл
        Прочитано = Поток.Прочитать(Буфер, 0, РазмерБуфера);

        Если Прочитано > 0 Тогда
            Тело = Тело.Соединить(Буфер);

        КонецЕсли;

        Если Прочитано < РазмерБуфера Тогда
            Прервать;

        КонецЕсли;

    КонецЦикла;

    РезультатЗапосаДанных = ПолучитьСтрокуИзБуфераДвоичныхДанных(Тело);
КонецПроцедуры
