// Гарант+ Килипенко 24.04.2025 [F00227785] Обмен Университет-БГУ ++ {
#Область ПрограммныйИнтерфейс

#Область СопоставлениеДанных

// Параметры:
//  ТаблицаФакультетов - ТаблицаЗначений - Изменяется в процессе выполнения функции (заполняется колонка Факультет)
//  СоздаватьНовыеЕслиОтсутствует - Булево - Устарела. Не используется при сопоставлении факультетов
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * Факультеты - СправочникСсылка.Подразделения
Функция СопоставитьФакультетыПолученныеИзУниверситет(ТаблицаФакультетов, Знач СоздаватьНовыеЕслиОтсутствует = Ложь) Экспорт
    РезультатФункции = Новый Структура("Успех, Факультеты, СообщенияОбОшибках",
            Истина, Новый Массив, Новый Массив);

    КэшСоответствийНаименованийФакультетовБГУ = ПолучитьКэшСоответствийНаименованийФакультетовБГУ();

    Для Каждого СтрокаТаблицы Из ТаблицаФакультетов Цикл
        СтруктураДанныхУниверситет = Новый Структура("Наименование, Идентификатор");
        ЗаполнитьЗначенияСвойств(СтруктураДанныхУниверситет, СтрокаТаблицы);
        СтруктураДанныхУниверситет.Наименование =
            КэшСоответствийНаименованийФакультетовБГУ.Получить(СтруктураДанныхУниверситет.Наименование);
        Если СтруктураДанныхУниверситет.Наименование = Неопределено Тогда
            // Нет данных соответствия
            СтруктураДанныхУниверситет.Наименование = СтрокаТаблицы.Наименование;
        КонецЕсли;

        ТекущийФакультетИБ = Неопределено;
        Если ЗначениеЗаполнено(СтрокаТаблицы.Факультет) = Ложь Тогда
            СтруктураНайденногоФакультета = НайтиФакультетПоДаннымУниверситет(СтруктураДанныхУниверситет);
            Если СтруктураНайденногоФакультета <> Неопределено Тогда
                ТекущийФакультетИБ = СтруктураНайденногоФакультета.Факультет;
            КонецЕсли;
        Иначе
            ТекущийФакультетИБ = СтрокаТаблицы.Факультет;
        КонецЕсли;

        Если ТекущийФакультетИБ <> Неопределено Тогда
            СтрокаТаблицы.Факультет = ТекущийФакультетИБ;
        Иначе
            РезультатФункции.СообщенияОбОшибках.Добавить(СтрШаблон(
                    "Не найден факультет << %1 (Подразделение: %2), Код: %3, Ид: %4 >>",
                    СтрокаТаблицы.Наименование,
                    СтруктураДанныхУниверситет.Наименование,
                    СтрокаТаблицы.Код,
                    СтрокаТаблицы.Идентификатор));
        КонецЕсли;
    КонецЦикла;

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  ТаблицаСтудентов - ТаблицаЗначений - Изменяется в процессе выполнения функции (заполняется колонка Контрагент)
//  СоздаватьНовыеЕслиОтсутствует - Булево
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * Студенты - СправочникСсылка.Студенты
Функция СопоставитьКонтрагентовСтудентовПолученныеИзУниверситет(ТаблицаСтудентов, Знач СоздаватьНовыеЕслиОтсутствует = Ложь) Экспорт
    РезультатФункции = Новый Структура("Успех, Студенты, СообщенияОбОшибках",
            Истина, Новый Массив, Новый Массив);

    Для Каждого СтрокаТаблицы Из ТаблицаСтудентов Цикл

    КонецЦикла;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СопоставлениеДанных

#Область ПоискОбъектов

// Параметры:
//  Наименование - Строка
// Возвращаемое значение:
//  - Массив из СправочникСсылка.Контрагент
Функция НайтиГруппыКонтрагентовПоНаименованию(Знач Наименование) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   Контрагенты.Ссылка КАК Контрагент,
        |   Контрагенты.Наименование КАК Наименование,
        |   Контрагенты.ПометкаУдаления КАК ПометкаУдаления
        |ИЗ
        |   Справочник.Контрагенты КАК Контрагенты
        |ГДЕ
        |   Контрагенты.ЭтоГруппа
        |   И НРег(СокрЛП(Контрагенты.Наименование)) = &Наименование
        |
        |УПОРЯДОЧИТЬ ПО
        |   Контрагенты.Ссылка УБЫВ
        |";

    Запрос.УстановитьПараметр("Наименование", НРег(СокрЛП(Наименование)));
    РезультатЗапроса = Запрос.Выполнить();

    ТаблицаДанных = РезультатЗапроса.Выгрузить();
    Если ТаблицаДанных.Количество() > 1 Тогда
        НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("ПометкаУдаления", Истина));
        Если НайденныеСтроки.Количество() < ТаблицаДанных.Количество() Тогда
            Для Каждого СтрокаУдаления Из НайденныеСтроки Цикл
                ТаблицаДанных.Удалить(СтрокаУдаления);
            КонецЦикла;
        КонецЕсли;
    КонецЕсли;

    Возврат ТаблицаДанных.ВыгрузитьКолонку("Контрагент");
КонецФункции

// Параметры:
//  ИдентификаторУниверситет - Строка
//  ВидОбъектаОбмена - ПланВидовХарактеристикСсылка.ГП_ТипыОбъектовОбменаУниверситетБГУ
//  МенеджерОбъекта - Произвольный
// Возвращаемое значение:
//  - Массив - Ссылка
Функция ПолучитьФильтрСсылокОбъектаИБПоИдентификаторуУниверситет(Знач ИдентификаторУниверситет, ВидОбъектаОбмена, МенеджерОбъекта) Экспорт
    РезультатФункции = Новый Массив;

    ТаблицаИдентификаторов = ПолучитьДанныеИдентификаторовДляВидаОбъектаОбмена(ВидОбъектаОбмена,
            Новый Структура("ИдентификаторВнешний", ИдентификаторУниверситет));

    Для Каждого СтрокаИдентификаторов Из ТаблицаИдентификаторов Цикл
        Если СтроковыеФункцииКлиентСервер.СвязьУстарела
            ИЛИ СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(СтрокаИдентификаторов.Идентификатор) = Ложь Тогда
            Продолжить;
        КонецЕсли;

        УникальныйИдентификаторПоиска = Новый УникальныйИдентификатор(СтрокаИдентификаторов.Идентификатор);
        НайденнаяСсылка = Неопределено;
        Если ЗначениеЗаполнено(УникальныйИдентификаторПоиска) Тогда
            НайденнаяСсылка = МенеджерОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаИдентификаторов.Идентификатор));
        КонецЕсли;

        Если НайденнаяСсылка <> Неопределено И НайденнаяСсылка.Пустая() = Ложь Тогда
            РезультатФункции.Добавить(НайденнаяСсылка);
        КонецЕсли;
    КонецЦикла;

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  СтруктураДанныхУниверситет - Структура, СтрокаТаблицыЗначений
//      * Наименование - Строка
//      * Идентификатор - Строка
// Возвращаемое значение:
//  - Структура, Неопределено
//      * Факультет - СправочникСсылка.Подразделения
//      * Код - Строка
//      * Наименование - Строка
//      * УникальныйИдентификатор - УникальныйИдентификатор
Функция НайтиФакультетПоДаннымУниверситет(Знач СтруктураДанныхУниверситет) Экспорт
    РезультатФункции = Неопределено;

    ВидОбъектаОбмена = ПланыВидовХарактеристик.ГП_ТипыОбъектовОбменаУниверситетБГУ.Факультет;
    ТаблицаИдентификаторов = ПолучитьДанныеИдентификаторовДляВидаОбъектаОбмена(ВидОбъектаОбмена,
            Новый Структура("ИдентификаторВнешний", СтруктураДанныхУниверситет.Идентификатор));

    ФильтрСсылокФакультетов = Новый Массив;
    Для Каждого СтрокаИдентификаторов Из ТаблицаИдентификаторов Цикл
        Если СтроковыеФункцииКлиентСервер.СвязьУстарела
            ИЛИ СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(СтрокаИдентификаторов.Идентификатор) = Ложь Тогда
            Продолжить;
        КонецЕсли;

        УникальныйИдентификаторПоиска = Новый УникальныйИдентификатор(СтрокаИдентификаторов.Идентификатор);
        НайденнаяСсылка = Неопределено;
        Если ЗначениеЗаполнено(УникальныйИдентификаторПоиска) Тогда
            НайденнаяСсылка = Справочники.Подразделения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаИдентификаторов.Идентификатор));
        КонецЕсли;

        Если НайденнаяСсылка <> Неопределено И НайденнаяСсылка.Пустая() = Ложь Тогда
            ФильтрСсылокФакультетов.Добавить(НайденнаяСсылка);
        КонецЕсли;
    КонецЦикла;

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   Факультеты.Ссылка КАК Факультет,
        |   Факультеты.Код КАК Код,
        |   Факультеты.Наименование КАК Наименование,
        |   УникальныйИдентификатор(Факультеты.Ссылка) КАК УникальныйИдентификатор
        |ИЗ
        |   Справочник.Подразделения КАК Факультеты
        |ГДЕ
        |   ИСТИНА
        |   И &УсловияФильтраСсылок
        |   И СокрЛП(НРег(Факультеты.Наименование)) = &Наименование
        |
        |УПОРЯДОЧИТЬ ПО
        |   Факультеты.Ссылка УБЫВ
        |";

    Запрос.УстановитьПараметр("Наименование", СокрЛП(НРег(СтруктураДанныхУниверситет.Наименование)));

    УсловияФильтраСсылок = "ИСТИНА";
    Если ФильтрСсылокФакультетов.Количество() > 0 Тогда
        УсловияФильтраСсылок = СтрШаблон("%1 И Факультеты.Ссылка В (%2)", УсловияФильтраСсылок, ФильтрСсылокФакультетов);
    КонецЕсли;

    Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияФильтраСсылок", УсловияФильтраСсылок);

    РезультатЗапроса = Запрос.Выполнить();
    ТаблицаДанных = РезультатЗапроса.Выгрузить();

    Если ТаблицаДанных.Количество() > 0 Тогда
        РезультатФункции = Новый Структура("Факультет, Код, Наименование, УникальныйИдентификатор");
        ЗаполнитьЗначенияСвойств(РезультатФункции, ТаблицаДанных[0]);
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

Функция НайтиСтудентаПоДаннымУниверситет(
        Знач СтруктураДанныхУниверситет, Знач ГруппаСтудентов = Неопределено, ИспользоватьСравнениеПоСНИЛС = Ложь) Экспорт

    ВидОбъектаОбмена = ПланыВидовХарактеристик.ГП_ТипыОбъектовОбменаУниверситетБГУ.КонтрагентСтудента;

    ФильтрСсылок = ПолучитьФильтрСсылокОбъектаИБПоИдентификаторуУниверситет(
            СтруктураДанныхУниверситет.Идентификатор, ВидОбъектаОбмена, Справочники.Студенты);

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   Студенты.Ссылка КАК Факультет,
        |   Студенты.Код КАК Код,
        |   Студенты.Наименование КАК Наименование,
        |   Студенты.Контрагент КАК Контрагент,
        |   ЕСТЬNULL(Контрагенты.ФизическоеЛицо, НЕОПРЕДЕЛЕНО) КАК ФизическоеЛицо,
        |   ЕСТЬNULL(Контрагенты.ФизическоеЛицо.СНИЛС, НЕОПРЕДЕЛЕНО) КАК СНИЛС
        |ИЗ
        |   Справочник.Студенты КАК Студенты
        |   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
        |       ПО Студенты.Контрагент = Контрагенты.Ссылка
        |   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
        |       ПО НЕ Контрагенты.Ссылка ЕСТЬ NULL
        |       И Контрагенты.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ФизическиеЛица
        |       И Контрагенты.ЮридическоеФизическоеЛицо = ФизическиеЛица.Ссылка
        |ГДЕ
        |   ИСТИНА
        |   И &ДополнительноеУсловиеГруппы
        |   И &УсловияФильтраСсылок
        |   И &ДополнительноеУсловиеПоСНИЛС
        |   И СокрЛП(НРег(Студенты.Наименование)) = &Наименование
        |
        |УПОРЯДОЧИТЬ ПО
        |   Студенты.Ссылка УБЫВ
        |";

    Запрос.УстановитьПараметр("Наименование", СокрЛП(НРег(СтруктураДанныхУниверситет.Наименование)));

    ДополнительноеУсловиеПоСНИЛС = "ИСТИНА";
    Если ИспользоватьСравнениеПоСНИЛС = Истина Тогда
        ДополнительноеУсловиеПоСНИЛС = СтрШаблон(
                "%1 И
                |   ВЫБОР
                |       КОГДА Контрагенты.ФизическоеЛицо ЕСТЬ NULL ТОГДА ИСТИНА
                |       КОГДА Контрагенты.ФизическоеЛицо.СНИЛС <> """" ТОГДА  Контрагенты.ФизическоеЛицо.СНИЛС = &СНИЛС
                |   КОНЕЦ", ДополнительноеУсловиеПоСНИЛС);
        Запрос.УстановитьПараметр("СНИЛС", СтруктураДанныхУниверситет.СНИЛС);
    КонецЕсли;
    Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительноеУсловиеПоСНИЛС", ДополнительноеУсловиеПоСНИЛС);

    ДополнительноеУсловиеГруппы = "ИСТИНА";
    Если ГруппаСтудентов = Неопределено Тогда
        ДополнительноеУсловиеГруппы = СтрШаблон("%1 И Студенты.ЭтоГруппа = ЛОЖЬ", ДополнительноеУсловиеГруппы);
    Иначе
        ДополнительноеУсловиеГруппы = СтрШаблон(
                "%1 И Студенты.ЭтоГруппа = ИСТИНА И Студенты.Группа = &ГруппаСтудентов", ДополнительноеУсловиеГруппы);
        Запрос.УстановитьПараметр("ГруппаСтудентов", ГруппаСтудентов);
    КонецЕсли;
    Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительноеУсловиеГруппы", ДополнительноеУсловиеГруппы);

    УсловияФильтраСсылок = "ИСТИНА";
    Если ФильтрСсылок.Количество() > 0 Тогда
        УсловияФильтраСсылок = СтрШаблон("%1 И Студенты.Ссылка В (%2)", УсловияФильтраСсылок, ФильтрСсылок);
    КонецЕсли;
    Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияФильтраСсылок", УсловияФильтраСсылок);

    РезультатЗапроса = Запрос.Выполнить();
    ТаблицаДанных = РезультатЗапроса.Выгрузить();

    // Отбор с приоритетом по СНИЛС
    Если ТаблицаДанных.Количество() > 1 И ИспользоватьСравнениеПоСНИЛС = Ложь
        И ПустаяСтрока(СтруктураДанныхУниверситет.СНИЛС) = Ложь Тогда

        НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("СНИЛС", СтруктураДанныхУниверситет.СНИЛС));
        Если НайденныеСтроки.Количество() > 0 Тогда
            РезультатФункции = НайденныеСтроки.Скопировать(НайденныеСтроки);
        КонецЕсли;
    КонецЕсли;

    Если ТаблицаДанных.Количество() > 0 Тогда
        РезультатФункции = Новый Структура("Факультет, Код, Наименование, УникальныйИдентификатор");
        ЗаполнитьЗначенияСвойств(РезультатФункции, ТаблицаДанных[0]);
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПоискОбъектов

#Область СоответствияОбъектов

Функция ПолучитьКэшПсевдонимовНаименованийТаблицУниверситет() Экспорт
    РезультатФункции = Новый Соответствие;

    РезультатФункции.Вставить("Студенты", "ФизическиеЛицаСтуденты");

    Возврат РезультатФункции;
КонецФункции

// Возвращаемое значение:
//  - Соответствие из КлючИЗначение
//      * Ключ - Строка - НаименованиеУниверситет
//      * Значение - Строка - НаименованиеБГУ
Функция ПолучитьКэшСоответствийНаименованийФакультетовБГУ() Экспорт
    ТаблицаСоответствийПоУмолчанию = ГП_ОбменУниверситетБГУПовтИсп.ПолучитьТаблицуСоответствийНаименованийФакультетовПоУмолчанию();

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   СоответствиеНаименований.Наименование КАК НаименованиеБГУ,
        |   СоответствиеНаименований.НаименованиеВнешнее КАК НаименованиеУниверситет
        |ИЗ
        |   РегистрСведений.ГП_СоответствиеНаименованийОбъектовОбменаУниверситетБГУ КАК СоответствиеНаименований
        |ГДЕ
        |   ИСТИНА
        |   И СоответствиеНаименований.ВидОбъектаОбмена = &ВидОбъектаОбмена
        |   И СоответствиеНаименований.ВидОбъектаОбменаДополнительный = &ВидОбъектаОбменаДополнительный
        |";

    Запрос.УстановитьПараметр("ВидОбъектаОбмена", ПланыВидовХарактеристик.ГП_ТипыОбъектовОбменаУниверситетБГУ.Факультет);
    Запрос.УстановитьПараметр("ВидОбъектаОбменаДополнительный", ПланыВидовХарактеристик.ГП_ТипыОбъектовОбменаУниверситетБГУ.ПустаяСсылка());

    РезультатЗапроса = Запрос.Выполнить();
    ТаблицаСоответствийРегистра = РезультатЗапроса.Выгрузить();

    РезультатФункции = Новый Соответствие;
    Для Каждого ТекущаяСтрока Из ТаблицаСоответствийПоУмолчанию Цикл
        РезультатФункции.Вставить(ТекущаяСтрока.НаименованиеУниверситет, ТекущаяСтрока.НаименованиеБГУ);
    КонецЦикла;
    Для Каждого ТекущаяСтрока Из ТаблицаСоответствийРегистра Цикл
        РезультатФункции.Вставить(ТекущаяСтрока.НаименованиеУниверситет, ТекущаяСтрока.НаименованиеБГУ);
    КонецЦикла;

    Возврат РезультатФункции;
КонецФункции

Функция ПолучитьДанныеИдентификаторовДляВидаОбъектаОбмена(Знач ВидОбъектаОбмена, Знач ПараметрыОтбора = Неопределено) Экспорт
    ПараметрыОтбора = ?(ПараметрыОтбора = Неопределено, Новый Структура, ПараметрыОтбора);

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   *
        |ИЗ
        |   РегистрСведений.ГП_ИдентификаторыОбменаУниверситетБГУ КАК ИдентификаторыОбменаУниверситетБГУ
        |ГДЕ
        |   ИдентификаторыОбменаУниверситетБГУ.ВидОбъектаОбмена = &ВидОбъектаОбмена
        |   И ИдентификаторыОбменаУниверситетБГУ.СвязьУстарела = ЛОЖЬ
        |   И &ДополнительныеПараметрыОтбора
        |";

    Запрос.УстановитьПараметр("ВидОбъектаОбмена", ВидОбъектаОбмена);

    ДополнительныеПараметрыОтбора = "ИСТИНА";
    НаименованиеТалицы = "ИдентификаторыОбменаУниверситетБГУ";
    Если ПараметрыОтбора.Свойство("ИдентификаторВнешний") Тогда
        ДополнительныеПараметрыОтбора = СтрШаблон("%1 И %2.ИдентификаторВнешний = &ИдентификаторВнешний",
                ДополнительныеПараметрыОтбора,
                НаименованиеТалицы);
        Запрос.УстановитьПараметр("ИдентификаторВнешний", ПараметрыОтбора.ИдентификаторВнешний);
    КонецЕсли;
    Если ПараметрыОтбора.Свойство("Идентификатор") Тогда
        ДополнительныеПараметрыОтбора = СтрШаблон("%1 И %2.Идентификатор = &Идентификатор",
                ДополнительныеПараметрыОтбора,
                НаименованиеТалицы);
        Запрос.УстановитьПараметр("Идентификатор", ПараметрыОтбора.Идентификатор);
    КонецЕсли;
    Если ПараметрыОтбора.Свойство("МинДатаСоздания") Тогда
        ДополнительныеПараметрыОтбора = СтрШаблон("%1 И %2.ДатаСоздания => &МинДатаСоздания",
                ДополнительныеПараметрыОтбора,
                НаименованиеТалицы);
        Запрос.УстановитьПараметр("МинДатаСоздания", ПараметрыОтбора.МинДатаСоздания);
    КонецЕсли;

    Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныеПараметрыОтбора", ДополнительныеПараметрыОтбора);

    РезультатЗапроса = Запрос.Выполнить();
    РезультатФункции = РезультатЗапроса.Выгрузить();
    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СоответствияОбъектов

#Область КонструкторыОбъектов

Функция НовыйТаблицаСправочникаУниверситет(Знач ТипСсылки) Экспорт
    РезультатФункции = Новый ТаблицаЗначений;

    РезультатФункции.Колонки.Добавить("Ссылка", ТипСсылки);
    РезультатФункции.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(100));
    РезультатФункции.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(100));
    РезультатФункции.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(500));

    Возврат РезультатФункции;
КонецФункции

Функция НовыйТаблицаДокументаУниверситет(Знач ТипСсылки) Экспорт
    РезультатФункции = Новый ТаблицаЗначений;

    РезультатФункции.Колонки.Добавить("Ссылка", ТипСсылки);
    РезультатФункции.Колонки.Добавить("Номер", ОбщегоНазначения.ОписаниеТипаСтрока(100));
    РезультатФункции.Колонки.Добавить("Дата", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
    РезультатФункции.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(100));
    РезультатФункции.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(500));

    Возврат РезультатФункции;
КонецФункции

// Возвращаемое значение:
//  - ТаблицаЗначений
//      * ИдентификаторИсточникаСвязи - Строка
//      * ИдентификаторОбъектаСвязи - Строка
Функция НовыйТаблицаИдентификаторовСвязей() Экспорт
    РезультатФункции = Новый Соответствие;
    Возврат РезультатФункции;
КонецФункции

// Возвращаемое значение:
//  - Структура
Функция НовыйКоллекцияТаблицИдентификаторовСвязей() Экспорт
    РезультатФункции = Новый Структура;

    МассивНаименованийТаблиц = Новый Массив;
    МассивНаименованийТаблиц.Добавить("Факультеты");
    МассивНаименованийТаблиц.Добавить("Студенты");
    МассивНаименованийТаблиц.Добавить("ТипыПриказов");
    МассивНаименованийТаблиц.Добавить("КурсыОбучения");
    МассивНаименованийТаблиц.Добавить("Специальности");
    МассивНаименованийТаблиц.Добавить("ОснованияПоступления");

    Для Каждого ИмяТаблицыКолонки Из МассивНаименованийТаблиц Цикл
        РезультатФункции.Вставить(ИмяТаблицыКолонки, НовыйТаблицаИдентификаторовСвязей());
    КонецЦикла;

    Возврат РезультатФункции;
КонецФункции

// Возвращаемое значение:
//  - ТаблицаЗначений
//      * ИдентификаторПриказа - Строка
//      * ИдентификаторФакультета - Строка
//      * ИдентификаторОснованияПоступления - Строка
//      * ИдентификаторТипаПриказа - Строка
//      * ИдентификаторСпециальности - Строка
Функция НовыйТаблицаИдентификаторовОбщихДанныхПриказа() Экспорт
    РезультатФункции = Новый ТаблицаЗначений;

    ТипКолонкиИдентификатора = ОбщегоНазначения.ОписаниеТипаСтрока(100);
    РезультатФункции.Колонки.Добавить("ИдентификаторПриказа", ТипКолонкиИдентификатора);
    РезультатФункции.Колонки.Добавить("ИдентификаторФакультета", ТипКолонкиИдентификатора);
    РезультатФункции.Колонки.Добавить("ИдентификаторОснованияПоступления", ТипКолонкиИдентификатора);
    РезультатФункции.Колонки.Добавить("ИдентификаторТипаПриказа", ТипКолонкиИдентификатора);
    РезультатФункции.Колонки.Добавить("ИдентификаторКурсаОбучения", ТипКолонкиИдентификатора);
    РезультатФункции.Колонки.Добавить("ИдентификаторСпециальности", ТипКолонкиИдентификатора);

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // КонструкторыОбъектов

#Область ЗаполнениеТаблицИзСырыхДанныхУниверситет

Функция ЗаполнитьТаблицыИдентификаторовСвязейПриказа(КоллекцияТаблицИдентификаторовСвязей, Знач СтруктураПриказа) Экспорт
    Для Каждого ЭлементКЗ Из КоллекцияТаблицИдентификаторовСвязей Цикл
        КэшПсевдонимовНаименованийТаблиц = ПолучитьКэшПсевдонимовНаименованийТаблицУниверситет();
        НаименованияТаблицыУниверситет = КэшПсевдонимовНаименованийТаблиц.Получить(ЭлементКЗ.Ключ);
        НаименованияТаблицыУниверситет = ?(НаименованияТаблицыУниверситет = Неопределено,
                ЭлементКЗ.Ключ, НаименованияТаблицыУниверситет);

        Если НЕ СтруктураПриказа.Свойство(НаименованияТаблицыУниверситет) Тогда
            Продолжить;
        КонецЕсли;

        МассивИдентификаторовПриказа = СтруктураПриказа[НаименованияТаблицыУниверситет];
        ТаблицаИдентификации = КоллекцияТаблицИдентификаторовСвязей[ЭлементКЗ.Ключ];
        ЗаполняемыйМассивСвязей = ТаблицаИдентификации.Получить(СтруктураПриказа.УникальныйИдентификатор);
        Если ЗаполняемыйМассивСвязей = Неопределено Тогда
            ЗаполняемыйМассивСвязей = Новый Массив;
            ТаблицаИдентификации.Вставить(СтруктураПриказа.УникальныйИдентификатор, ЗаполняемыйМассивСвязей);
        КонецЕсли;
        Для Каждого ТекущийИдентификатор Из МассивИдентификаторовПриказа Цикл
            ЗаполняемыйМассивСвязей.Добавить(ТекущийИдентификатор);
        КонецЦикла;
    КонецЦикла;

    Возврат Истина;
КонецФункции

// Возвращаемое значение:
//  - Число
Функция ЗаполнитьТаблицуИдентификаторовОбщихДанныхПриказа(
        ТаблицаИдентификаторов, Знач ИдентификаторПриказа, Знач ДанныеИдентификаторов, Знач Очищать = Истина) Экспорт

    Если Очищать = Истина Тогда
        ТаблицаИдентификаторов.Очистить();
    КонецЕсли;

    КоличествоДобавленных = 0;
    Для Каждого СтрокаДанных Из ДанныеИдентификаторов Цикл
        НоваяСтрока = ТаблицаИдентификаторов.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
        НоваяСтрока.ИдентификаторПриказа = ИдентификаторПриказа;
        КоличествоДобавленных = КоличествоДобавленных + 1;
    КонецЦикла;

    Возврат КоличествоДобавленных;
КонецФункции

// Возвращаемое значение:
//  - Число
Функция ДополнитьТаблицуИдентификаторовОбщихДанныхПриказа(
        ТаблицаИдентификаторов, Знач ИдентификаторПриказа, Знач ДанныеИдентификаторов) Экспорт

    Возврат ЗаполнитьТаблицуИдентификаторовОбщихДанныхПриказа(
        ТаблицаИдентификаторов, ИдентификаторПриказа, ДанныеИдентификаторов, Ложь);
КонецФункции

#КонецОбласти // ЗаполнениеТаблицИзСырыхДанныхУниверситет

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 24.04.2025 [F00227785] Обмен Университет-БГУ -- }
